MikroElektronika/core_packages/ARM/gcc_clang/startup/nxp/mkv42f128vlf16.s
    .weak      ADCB_IRQHandler
    .thumb_set ADCB_IRQHandler,Default_Handler

    .weak      Reserved90_IRQHandler
    .thumb_set Reserved90_IRQHandler,Default_Handler

    .weak      CAN0_ORed_Message_buffer_IRQHandler
    .thumb_set CAN0_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN0_Bus_Off_IRQHandler
    .thumb_set CAN0_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN0_Error_IRQHandler
    .thumb_set CAN0_Error_IRQHandler,Default_Handler

    .weak      CAN0_Tx_Warning_IRQHandler
    .thumb_set CAN0_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Rx_Warning_IRQHandler
    .thumb_set CAN0_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN0_Wake_Up_IRQHandler
    .thumb_set CAN0_Wake_Up_IRQHandler,Default_Handler

    .weak      Reserved97_IRQHandler
    .thumb_set Reserved97_IRQHandler,Default_Handler

    .weak      Reserved98_IRQHandler
    .thumb_set Reserved98_IRQHandler,Default_Handler

    .weak      Reserved99_IRQHandler
    .thumb_set Reserved99_IRQHandler,Default_Handler

    .weak      Reserved100_IRQHandler
    .thumb_set Reserved100_IRQHandler,Default_Handler

    .weak      Reserved101_IRQHandler
    .thumb_set Reserved101_IRQHandler,Default_Handler

    .weak      Reserved102_IRQHandler
    .thumb_set Reserved102_IRQHandler,Default_Handler

    .weak      Reserved103_IRQHandler
    .thumb_set Reserved103_IRQHandler,Default_Handler

    .weak      Reserved104_IRQHandler
    .thumb_set Reserved104_IRQHandler,Default_Handler

    .weak      Reserved105_IRQHandler
    .thumb_set Reserved105_IRQHandler,Default_Handler

    .weak      Reserved106_IRQHandler
    .thumb_set Reserved106_IRQHandler,Default_Handler

    .weak      Reserved107_IRQHandler
    .thumb_set Reserved107_IRQHandler,Default_Handler

    .weak      CMP3_IRQHandler
    .thumb_set CMP3_IRQHandler,Default_Handler

    .weak      Reserved109_IRQHandler
    .thumb_set Reserved109_IRQHandler,Default_Handler

    .weak      CAN1_ORed_Message_buffer_IRQHandler
    .thumb_set CAN1_ORed_Message_buffer_IRQHandler,Default_Handler

    .weak      CAN1_Bus_Off_IRQHandler
    .thumb_set CAN1_Bus_Off_IRQHandler,Default_Handler

    .weak      CAN1_Error_IRQHandler
    .thumb_set CAN1_Error_IRQHandler,Default_Handler

    .weak      CAN1_Tx_Warning_IRQHandler
    .thumb_set CAN1_Tx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Rx_Warning_IRQHandler
    .thumb_set CAN1_Rx_Warning_IRQHandler,Default_Handler

    .weak      CAN1_Wake_Up_IRQHandler
    .thumb_set CAN1_Wake_Up_IRQHandler,Default_Handler
